docs/shrew.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-05-18 Tue 17:16 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Shrew LISP Project</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="/static/css/org.css">
</head>
<body>
<div id="preamble" class="status">
<a href="/">Home</a>
</div>
<div id="content">
<header>
<h1 class="title">Shrew LISP Project</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd250ac3">1. Resources</a></li>
<li><a href="#org0b8a48a">2. Enhancements</a></li>
<li><a href="#org605436e">3. Long Term Goal</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgd250ac3" class="outline-2">
<h2 id="orgd250ac3"><span class="section-number-2">1</span> Resources</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://github.com/kanaka/mal/blob/master/process/guide.md#step0">MAL</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0b8a48a" class="outline-2">
<h2 id="org0b8a48a"><span class="section-number-2">2</span> Enhancements</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Need to work on EOF issue for contiuation of list processing</li>
<li>Better input handling for REPL, maybe use <a href="https://github.com/peterh/liner">Liner</a> or <a href="https://github.com/c-bata/go-prompt">Go Prompt</a></li>
<li>History buffer</li>
<li>Make sure compatable with Little Schemer Text</li>
</ul>
</div>
</div>

<div id="outline-container-org605436e" class="outline-2">
<h2 id="org605436e"><span class="section-number-2">3</span> Long Term Goal</h2>
<div class="outline-text-2" id="text-3">
<p>
I want to be able to follow the "Little" Book series (Schemer, Reasoned Schemer, Prover, etc) with my own Lisp.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-05-18 Tue 17:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
